In [27]:
# Group By operationd involves:
# - Splitting or grouping data
# - Apply some function like aggregates to those groups
# - Combine

In [24]:
import pandas as pd
import numpy as np

In [28]:
mydf = pd.DataFrame({'Company':['A','A','B','B','C','C'],'Person':['Sam','Mon','Kappu','Carl','Sarah','Chirag'], 'Sales':[1000,500,2220,4021,1120,6234]})

In [29]:
mydf

  Company  Person  Sales
0       A     Sam   1000
1       A     Mon    500
2       B   Kappu   2220
3       B    Carl   4021
4       C   Sarah   1120
5       C  Chirag   6234

In [33]:
mydf.groupby('Company').mean()

          Sales
Company
A         750.0
B        3120.5
C        3677.0

In [34]:
mydf.groupby('Company').max()

        Person  Sales
Company
A          Sam   1000
B        Kappu   4021
C        Sarah   6234

In [35]:
mydf.groupby('Company').std()

               Sales
Company
A         353.553391
B        1273.499313
C        3616.144079

In [36]:
mydf.groupby('Company').describe()

        Sales
        count    mean          std     min      25%     50%      75%     max
Company
A         2.0   750.0   353.553391   500.0   625.00   750.0   875.00  1000.0
B         2.0  3120.5  1273.499313  2220.0  2670.25  3120.5  3570.75  4021.0
C         2.0  3677.0  3616.144079  1120.0  2398.50  3677.0  4955.50  6234.0

In [39]:
mydf.groupby('Company').max().transpose()

Company     A      B      C
Person    Sam  Kappu  Sarah
Sales    1000   4021   6234

In [40]:
# Operations:

In [41]:
mydf

  Company  Person  Sales
0       A     Sam   1000
1       A     Mon    500
2       B   Kappu   2220
3       B    Carl   4021
4       C   Sarah   1120
5       C  Chirag   6234

In [42]:
mydf['Company'].unique()

array(['A', 'B', 'C'], dtype=object)

In [43]:
mydf['Company'].nunique()

3

In [44]:
mydf['Company'].value_counts()

C    2
A    2
B    2
Name: Company, dtype: int64

In [50]:
# Retrieve records where Sales > 1000 and Company == (B or C)

mydf[(mydf['Sales']>1000) & 
     (
         (mydf['Company'] == 'B') | 
         (mydf['Company'] == 'C')
     )
    ]

  Company  Person  Sales
2       B   Kappu   2220
3       B    Carl   4021
4       C   Sarah   1120
5       C  Chirag   6234

In [51]:
# Applying function to every value in a column:

def times_two(num):
    return num*2

In [58]:
mydf.apply(times_two)

  Company        Person  Sales
0      AA        SamSam   2000
1      AA        MonMon   1000
2      BB    KappuKappu   4440
3      BB      CarlCarl   8042
4      CC    SarahSarah   2240
5      CC  ChiragChirag  12468

In [65]:
# To apply function to specific column in a df:

mydf['Twice_sales']=mydf['Sales'].apply(times_two)

In [66]:
mydf

  Company  Person  Sales  Twice_sales
0       A     Sam   1000         2000
1       A     Mon    500         1000
2       B   Kappu   2220         4440
3       B    Carl   4021         8042
4       C   Sarah   1120         2240
5       C  Chirag   6234        12468

In [67]:
# To remove a column from a df:
del mydf['Twice_sales'] # or using df.drop()

In [68]:
mydf

  Company  Person  Sales
0       A     Sam   1000
1       A     Mon    500
2       B   Kappu   2220
3       B    Carl   4021
4       C   Sarah   1120
5       C  Chirag   6234

In [69]:
mydf.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [70]:
mydf.index

RangeIndex(start=0, stop=6, step=1)

In [71]:
mydf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Company    6 non-null object
Person     6 non-null object
Sales      6 non-null int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [72]:
mydf.describe()

             Sales
count     6.000000
mean   2515.833333
std    2213.029274
min     500.000000
25%    1030.000000
50%    1670.000000
75%    3570.750000
max    6234.000000

In [73]:
mydf

  Company  Person  Sales
0       A     Sam   1000
1       A     Mon    500
2       B   Kappu   2220
3       B    Carl   4021
4       C   Sarah   1120
5       C  Chirag   6234

In [75]:
mydf.sort_values('Sales',ascending=False)

  Company  Person  Sales
5       C  Chirag   6234
3       B    Carl   4021
2       B   Kappu   2220
4       C   Sarah   1120
0       A     Sam   1000
1       A     Mon    500

In [81]:
os.curdir

'.'